bit-finance/Reports/бит_ДвиженияДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_ДвиженияДокумента</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВВидеТаблицы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/Reports/бит_ДвиженияДокумента/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Отчет);

	МетаданныеОбъекта = Метаданные.Отчеты.бит_ДвиженияДокумента;
		
	Если фОтказ Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Документ", Отчет.Документ);
	
    ПоказыватьДокумент = ?(Параметры.Свойство("ПоказыватьДокумент"), Параметры.ПоказыватьДокумент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// По умолчанию выводим в виде таблицы.
	ВыводДетализации 		   = "Вертикали";
	Отчет.ВыводитьВВидеТаблицы = Ложь;
	
	Если Не ОтчетСформирован Тогда
		СформироватьИВывестиОтчет();
		ОтчетСформирован = Истина;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыводДетализацииПриИзменении(Элемент)
	
	Если ВыводДетализации = "Вертикали" Тогда
		Отчет.ВыводитьВВидеТаблицы = Ложь;
	Иначе
		Отчет.ВыводитьВВидеТаблицы = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВыполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Отчет.Документ) Тогда
		ТекстСообщения = НСтр("ru = 'Выберите документ, движения которого необходимо увидеть'; 
		                      |en = 'Select the document whose movements you want to see'");
		ПоказатьПредупреждение( ,ТекстСообщения);     		
		Возврат;
	КонецЕсли;
	
	СформироватьИВывестиОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура осуществляет управление доступностью/видимостью элементов формы.
// 
&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Элементы.Документ.Видимость = ПоказыватьДокумент;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

// Процедура вызывает процедуру объекта отчета по формированию.
// 
&НаСервере
Процедура СформироватьИВывестиОтчет()
	                       
	РеквизитФормыВЗначение("Отчет").СформироватьОтчет(ТабличныйДокумент);
	
КонецПроцедуры

#КонецОбласти
